УТ/src/ExchangePlans/CRM_ОбменB2BПортал/CRM_ОбменB2BПортал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="b5a84de0-f9fb-4ffd-a51e-e980bae8fe87">
  <name>CRM_ОбменB2BПортал</name>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

УТ/src/ExchangePlans/CRM_ОбменB2BПортал/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Ссылка = ПланыОбмена.CRM_ОбменB2BПортал.ЭтотУзел() Тогда
		Элементы.URL.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Логин.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Таймаут.АвтоОтметкаНезаполненного = Ложь;
		Элементы.URL.Доступность = Ложь;
		Элементы.Логин.Доступность = Ложь;
		Элементы.Таймаут.Доступность = Ложь;
		Элементы.Пароль.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
